OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nand/semc/fsl_semc_nand_flash.c
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include "fsl_nand_flash.h"
#include "fsl_semc_nand_flash.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define NAND_READY_CHECK_INTERVAL_NORMAL (0U)
#define NAND_MAX_FEATURE_ACCESS_TIME_tFEAT_US (1000U)
#define NAND_MAX_READ_PARAMETER_PAGE_TIME_tR_US (1000U)
#define NAND_FIRST_CMD_CHANGE_COLUMN_SETUP_TIME_NS (500U)
#define NAND_MAX_RST_TIME0_tRST_US (5U)
#define NAND_MAX_RST_TIME1_tRST_US (10U)
#define NAND_MAX_RST_TIME2_tRST_US (500U)
#define NAND_MAX_RST_TIME3_tRST_US (1000U)
#define NAND_ONFI_SIGNATURE_MIN_MATCHED_BYTES (0x2U)
#define NAND_FLASH_DEVICEFEATURE_MT29F_ARRAYOPTIONMODEADDRESS (0x90U)
#define NAND_FLASH_DEVICEFEATURE_MT29F_ARRAYOPTIONMODE_DISABLEECC (0x00u)
#define NAND_FLASH_DEVICEFEATURE_MT29F_ARRAYOPTIONMODE_ENABLEECC (0x08u)
#define NAND_FLASH_SR_ONFI_PASSBITMASK (0x01U)
#define NAND_FLASH_SR_ONFI_READYBITMASK (0x40U)
#define NAND_FLASH_COLUMNBITSNUM_MAX (16U)

/*! @brief Constructs the four character code for tag */
#if !defined(FOUR_CHAR_CODE)
#define FOUR_CHAR_CODE(a, b, c, d) (((d) << 24) | ((c) << 16) | ((b) << 8) | ((a)))
#endif

/*! @brief Parallel NAND timing config */
typedef struct _nand_ac_timing_parameter
{
    uint16_t min_tCS_ns;
    uint16_t min_tCH_ns;
    uint16_t min_tCEITV_ns;
    uint16_t min_tWP_ns;
    uint16_t min_tWH_ns;
    uint16_t min_tRP_ns;
    uint16_t min_tREH_ns;
    uint16_t min_tTA_ns;
    uint16_t min_tWHR_ns;
    uint16_t min_tRHW_ns;
    uint16_t min_tADL_ns;
    uint16_t min_tRR_ns;
    uint16_t max_tWB_ns;
} nand_ac_timing_parameter_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static status_t semc_nand_issue_reset(nand_handle_t *handle);
static status_t semc_nand_issue_read_mode(nand_handle_t *handle);
static status_t semc_nand_issue_access_feature(nand_handle_t *handle, nand_onfi_feature_config_t *featureConfig);
static status_t semc_nand_issue_read_parameter(nand_handle_t *handle, nand_onfi_parameter_config_t *parameterConfig);
static status_t semc_nand_issue_read_status(nand_handle_t *handle, uint8_t *stat);
static status_t semc_nand_issue_read_page(nand_handle_t *handle, uint32_t ipgCmdAddr);
/* Read onfi parameter data from device and make use of them*/
static status_t semc_nand_get_onfi_timing_configure(nand_handle_t *handle, nand_config_t *config);
/* Check the device ready status*/
static status_t semc_nand_wait_status_ready(nand_handle_t *handle, uint32_t readyCheckIntervalInUs, bool readOpen);
/* Enable the device ECC via feature setting*/
static status_t semc_nand_set_device_ecc(nand_handle_t *handle);
/* Validates data by using device ECC*/
static status_t semc_nand_is_device_ecc_check_passed(nand_handle_t *handle, bool *isEccPassed);
/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Define the onfi timing mode. */
const nand_ac_timing_parameter_t s_nandAcTimingParameterTable[] = {
    /* ONFI 1.0, mode 0, 10MHz, 100ns */
    {.min_tCS_ns    = 70,
     .min_tCH_ns    = 20,
     .min_tCEITV_ns = 0,
     .min_tWP_ns    = 50,
     .min_tWH_ns    = 30,
     .min_tRP_ns    = 50,
     .min_tREH_ns   = 30,
     .min_tTA_ns    = 0,
     .min_tWHR_ns   = 120,
     .min_tRHW_ns   = 200,
     .min_tADL_ns   = 200,
     .min_tRR_ns    = 40,
     .max_tWB_ns    = 200},
    /* ONFI 1.0 mode 1, 20MHz, 50ns */
    {35, 10, 0, 25, 15, 25, 15, 0, 80, 100, 100, 20, 100},
    /* ONFI 1.0 mode 2, 28MHz, 35ns */
    {25, 10, 0, 17, 15, 17, 15, 0, 80, 100, 100, 20, 100},
    /* ONFI 1.0 mode 3, 33MHz, 30ns */
    {25, 5, 0, 15, 10, 15, 10, 0, 60, 100, 100, 20, 100},

    /* Note: From ONFI spec, The host shall use EDO data output cycle timings,
       when running with a tRC value less than 30 ns. (tRC = tRP + tREH) */
    /* ONFI 1.0 mode 4, 40MHz, 25ns */
    {20, 5, 0, 12, 10, 12, 10, 0, 60, 100, 70, 20, 100},
    /* ONFI 1.0 mode 5, 50MHz, 20ns */
    {15, 5, 0, 10, 7, 10, 7, 0, 60, 100, 70, 20, 100},
    /* Auto-Detection */
    {0}};

const uint8_t s_nandDeviceManufacturerList[][12] = {{'M', 'I', 'C', 'R', 'O', 'N', ' ', ' ', ' ', ' ', ' ', ' '},
                                                    {'S', 'P', 'A', 'N', 'S', 'I', 'O', 'N', ' ', ' ', ' ', ' '},
                                                    {'S', 'A', 'M', 'S', 'U', 'N', 'G', ' ', ' ', ' ', ' ', ' '},
                                                    {'W', 'I', 'N', 'B', 'O', 'N', 'D', ' ', ' ', ' ', ' ', ' '},
                                                    {'H', 'Y', 'N', 'I', 'X', ' ', ' ', ' ', ' ', ' ', ' ', ' '},
                                                    {'T', 'O', 'S', 'H', 'I', 'B', 'A', ' ', ' ', ' ', ' ', ' '},
                                                    {'M', 'A', 'C', 'R', 'O', 'N', 'I', 'X', ' ', ' ', ' ', ' '},
                                                    {0}};

semc_mem_nand_handle_t semc_handle;

/*******************************************************************************
 * API
 ******************************************************************************/
static void semc_get_default_timing_configure(semc_nand_timing_config_t *semcNandTimingConfig)
{
    assert(semcNandTimingConfig);

    /* Configure Timing mode 0 for timing parameter.*/
    const nand_ac_timing_parameter_t *nandTiming =
        &s_nandAcTimingParameterTable[kNandAcTimingTableIndex_ONFI_1p0_Mode0_10MHz];
    semcNandTimingConfig->tCeSetup_Ns        = nandTiming->min_tCS_ns;
    semcNandTimingConfig->tCeHold_Ns         = nandTiming->min_tCH_ns;
    semcNandTimingConfig->tCeInterval_Ns     = nandTiming->min_tCEITV_ns;
    semcNandTimingConfig->tWeLow_Ns          = nandTiming->min_tWP_ns;
    semcNandTimingConfig->tWeHigh_Ns         = nandTiming->min_tWH_ns;
    semcNandTimingConfig->tReLow_Ns          = nandTiming->min_tRP_ns;
    semcNandTimingConfig->tReHigh_Ns         = nandTiming->min_tREH_ns;
    semcNandTimingConfig->tTurnAround_Ns     = nandTiming->min_tTA_ns;
    semcNandTimingConfig->tWehigh2Relow_Ns   = nandTiming->min_tWHR_ns;
    semcNandTimingConfig->tRehigh2Welow_Ns   = nandTiming->min_tRHW_ns;
    semcNandTimingConfig->tAle2WriteStart_Ns = nandTiming->min_tADL_ns;
    semcNandTimingConfig->tReady2Relow_Ns    = nandTiming->min_tRR_ns;
    semcNandTimingConfig->tWehigh2Busy_Ns    = nandTiming->max_tWB_ns;
}

static status_t semc_nand_get_onfi_timing_configure(nand_handle_t *handle, nand_config_t *config)
{
    assert(config->memControlConfig);
    assert(handle->deviceSpecific);

