OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nand/semc/fsl_semc_nand_flash.c
    status_t status       = kStatus_Success;
    uint32_t matchedBytes = 0;
    uint32_t ch;
    uint32_t nandOnfiTag                                 = FOUR_CHAR_CODE('O', 'N', 'F', 'I');
    nand_onfi_parameter_config_t nandOnfiParameterConfig = {0};
    uint8_t acTimingTableIndex                           = 0;
    semc_mem_nand_config_t *semcNandConfig               = (semc_mem_nand_config_t *)config->memControlConfig;
    semc_nand_config_t *semcConfig                       = semcNandConfig->semcNandConfig;
    semc_mem_nand_handle_t *semcHandle                   = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    /* Read First ONFI parameter data from device */
    status = semc_nand_issue_read_parameter(handle, &nandOnfiParameterConfig);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Check ONFI signature. */
    for (uint32_t i = 0; i < sizeof(nandOnfiParameterConfig.signature); i++)
    {
        if ((*(((uint8_t *)&nandOnfiTag) + i)) == (*(((uint8_t *)&nandOnfiParameterConfig.signature) + i)))
        {
            matchedBytes++;
        }
    }
    if (matchedBytes < NAND_ONFI_SIGNATURE_MIN_MATCHED_BYTES)
    {
        return kStatus_Fail;
    }

    /* Get device vendor */
    handle->vendorType = kNandVendorType_Unknown;
    for (uint32_t vendorIndex = kNandVendorType_Micron; vendorIndex < kNandVendorType_Unknown; vendorIndex++)
    {
        for (ch = 0; ch < sizeof(s_nandDeviceManufacturerList[vendorIndex]); ch++)
        {
            if (s_nandDeviceManufacturerList[vendorIndex][ch] != nandOnfiParameterConfig.deviceManufacturer[ch])
            {
                break;
            }
        }
        if (ch == sizeof(s_nandDeviceManufacturerList[vendorIndex]))
        {
            handle->vendorType = vendorIndex;
            break;
        }
    }

    /* Set NAND feature/command info in handler */
    semcHandle->isFeatureCommandSupport = nandOnfiParameterConfig.optionalCommands.setGetfeatures;
    if (nandOnfiParameterConfig.optionalCommands.readStatusEnhanced)
    {
        semcHandle->statusCommandType = kNandStatusCommandType_Enhanced;
    }
    else
    {
        semcHandle->statusCommandType = kNandStatusCommandType_Common;
    }
    if (nandOnfiParameterConfig.optionalCommands.changeReadColumnEnhanced)
    {
        semcHandle->changeReadColumnType = kNandChangeReadColumnCommandType_Enhanced;
    }
    else
    {
        semcHandle->changeReadColumnType = kNandChangeReadColumnCommandType_Common;
    }
    handle->bytesInPageDataArea     = nandOnfiParameterConfig.dataBytesPerPage;
    handle->bytesInPageSpareArea    = nandOnfiParameterConfig.spareBytesPerPage;
    handle->pagesInBlock            = nandOnfiParameterConfig.pagesPerBlock;
    handle->blocksInPlane           = nandOnfiParameterConfig.blocksPerLUN;
    handle->planesInDevice          = nandOnfiParameterConfig.LUNsPerDevice;
    semcHandle->pageReadTimeInUs_tR = ((uint32_t)nandOnfiParameterConfig.maxPageReadTimeInUs[1] << 8) +
                                      nandOnfiParameterConfig.maxPageReadTimeInUs[0];
    semcHandle->blockEraseTimeInUs_tBERS = ((uint32_t)nandOnfiParameterConfig.maxBlockEraseTimeInUs[1] << 8) +
                                           nandOnfiParameterConfig.maxBlockEraseTimeInUs[0];
    semcHandle->PageProgramTimeInUs_tPROG = ((uint32_t)nandOnfiParameterConfig.maxPageProgramTimeInUs[1] << 8) +
                                            nandOnfiParameterConfig.maxPageProgramTimeInUs[0];
    semcHandle->pageReadTimeInUs_tR >>= 2;
    semcHandle->blockEraseTimeInUs_tBERS >>= 2;
    semcHandle->PageProgramTimeInUs_tPROG >>= 2;
    /* Set change cloumn setup time for AXI access */
    semcHandle->changeColumnSetupTimeInNs_tCCS =
        ((uint32_t)nandOnfiParameterConfig.minChangeColunmSetupTimeInNs[1] << 8) +
        nandOnfiParameterConfig.minChangeColunmSetupTimeInNs[0];

    switch (nandOnfiParameterConfig.addressCycles)
    {
        case 0x22u:
            semcConfig->arrayAddrOption = kSEMC_NandAddrOption_4byte_CA2RA2;
            break;
        case 0x21u:
            semcConfig->arrayAddrOption = kSEMC_NandAddrOption_3byte_CA2RA1;
            break;
        case 0x13u:
            semcConfig->arrayAddrOption = kSEMC_NandAddrOption_4byte_CA1RA3;
            break;
        case 0x12u:
            semcConfig->arrayAddrOption = kSEMC_NandAddrOption_3byte_CA1RA2;
            break;
        case 0x11u:
            semcConfig->arrayAddrOption = kSEMC_NandAddrOption_2byte_CA1RA1;
            break;
        case 0x23u:
        default:
            semcConfig->arrayAddrOption = kSEMC_NandAddrOption_5byte_CA2RA3;
            break;
    }

    /* Get onfi timing mode for timing mode setting only when appliation have no timing configuration. */
    if (!semcConfig->timingConfig)
    {
        const nand_ac_timing_parameter_t *timingArray;

        if (nandOnfiParameterConfig.timingMode.mode5)
        {
            acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode5_50MHz;
        }
        else if (nandOnfiParameterConfig.timingMode.mode4)
        {
            acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode4_40MHz;
        }
        else if (nandOnfiParameterConfig.timingMode.mode3)
        {
            acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode3_33MHz;
        }
        else if (nandOnfiParameterConfig.timingMode.mode2)
        {
            acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode2_28MHz;
        }
        else if (nandOnfiParameterConfig.timingMode.mode1)
        {
            acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode1_20MHz;
        }
        else
        {
            acTimingTableIndex = kNandAcTimingTableIndex_ONFI_1p0_Mode0_10MHz;
        }

        /* Set the semc nand configuration again */
        timingArray                                  = &s_nandAcTimingParameterTable[acTimingTableIndex];
        semcConfig->timingConfig->tCeSetup_Ns        = timingArray->min_tCS_ns;
        semcConfig->timingConfig->tCeHold_Ns         = timingArray->min_tCH_ns;
        semcConfig->timingConfig->tCeInterval_Ns     = timingArray->min_tCEITV_ns;
        semcConfig->timingConfig->tWeLow_Ns          = timingArray->min_tWP_ns;
        semcConfig->timingConfig->tWeHigh_Ns         = timingArray->min_tWH_ns;
        semcConfig->timingConfig->tReLow_Ns          = timingArray->min_tRP_ns;
        semcConfig->timingConfig->tReHigh_Ns         = timingArray->min_tREH_ns;
        semcConfig->timingConfig->tTurnAround_Ns     = timingArray->min_tTA_ns;
        semcConfig->timingConfig->tWehigh2Relow_Ns   = timingArray->min_tWHR_ns;
        semcConfig->timingConfig->tRehigh2Welow_Ns   = timingArray->min_tRHW_ns;
        semcConfig->timingConfig->tAle2WriteStart_Ns = timingArray->min_tADL_ns;
        semcConfig->timingConfig->tReady2Relow_Ns    = timingArray->min_tRR_ns;
        semcConfig->timingConfig->tWehigh2Busy_Ns    = timingArray->max_tWB_ns;

        /* Change the timing mode: on onfi spec, enable EDO mode when using timing mode 4 and 5. */
        if ((acTimingTableIndex == kNandAcTimingTableIndex_ONFI_1p0_Mode4_40MHz) ||
            (acTimingTableIndex == kNandAcTimingTableIndex_ONFI_1p0_Mode5_50MHz))
        {
            semcConfig->edoModeEnabled = true;
        }

        if ((acTimingTableIndex > kNandAcTimingTableIndex_ONFI_1p0_Mode0_10MHz) &&
            (acTimingTableIndex <= kNandAcTimingTableIndex_ONFI_1p0_Mode5_50MHz) &&
            nandOnfiParameterConfig.optionalCommands.setGetfeatures)
        {
            /* Switch to specific timing mode */
            nand_onfi_feature_config_t featureConfig = {.command      = kNandDeviceCmd_ONFI_SetFeatures,
                                                        .address      = 0x01, /* Feature address for timing mode. */
                                                        .parameter[0] = acTimingTableIndex,
                                                        .parameter[1] = 0,
                                                        .parameter[2] = 0,
                                                        .parameter[3] = 0};
            status                                   = semc_nand_issue_access_feature(handle, &featureConfig);
            if (status != kStatus_Success)
            {
                return status;
            }

            /* Get current timing mode to double check */
            featureConfig.command      = kNandDeviceCmd_ONFI_GetFeatures;
            featureConfig.parameter[0] = 0;
            status                     = semc_nand_issue_access_feature(handle, &featureConfig);
            if (status != kStatus_Success)
            {
                return status;
            }

            if (featureConfig.parameter[0] != acTimingTableIndex)
            {
                return kStatus_Fail;
            }
            if (status != kStatus_Success)
            {
                return status;
            }
        }
    }

