OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nand/semc/fsl_semc_nand_flash.c
    return status;
}

static status_t semc_nand_wait_status_ready(nand_handle_t *handle, uint32_t readyCheckIntervalInUs, bool readOpen)
{
    status_t status                    = kStatus_Success;
    bool isDeviceReady                 = false;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    if (!semcHandle->delayUS)
    {
        return kStatus_Fail;
    }

    while (!isDeviceReady)
    {
        if (semcHandle->readyCheckOption == kNandReadyCheckOption_SR)
        {
            /* Get SR value from Device by issuing READ STATUS commmand */
            uint8_t stat = 0;

            semcHandle->delayUS(readyCheckIntervalInUs);
            status = semc_nand_issue_read_status(handle, &stat);
            if (status != kStatus_Success)
            {
                return status;
            }
            /* stat[RDY] = 0, Busy, stat[RDY] = 1, Ready */
            isDeviceReady = (stat & NAND_FLASH_SR_ONFI_READYBITMASK);
        }
        else if (semcHandle->readyCheckOption == kNandReadyCheckOption_RB)
        {
            /* Monitors the target's R/B# signal to determine the progress. */
            isDeviceReady = SEMC_IsNandReady((SEMC_Type *)handle->driverBaseAddr);
            if (!isDeviceReady)
            {
                semcHandle->delayUS(readyCheckIntervalInUs);
                isDeviceReady = SEMC_IsNandReady((SEMC_Type *)handle->driverBaseAddr);
            }
        }
    }

    /* Note: If the ReadStatus command is used to monitor for command completion, the
    ReadMode command must be used to re-enable data output mode.
    */
    if ((readOpen) && (semcHandle->readyCheckOption == kNandReadyCheckOption_SR))
    {
        status = semc_nand_issue_read_mode(handle);
        if (status != kStatus_Success)
        {
            return status;
        }
    }
    return kStatus_Success;
}

static status_t semc_nand_issue_reset(nand_handle_t *handle)
{
    status_t status;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    /* The RESET command may be executed with the target in any state */
    uint16_t commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_Reset,
                                                   kSEMC_NANDAM_ColumnRow, // Don't care
                                                   kSEMC_NANDCM_Command);  // Command Only
    status = SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, semcHandle->ctlAccessMemAddr1,
                                commandCode, 0, 0);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* For ONFI 1.0 Timing mode 0, the max tRST = 1000us
       For ONFI 1.O other timing modes, the max tRST = 5/10/500us
      The target is allowed a longer maximum reset time when a program or erase operation is in progress. The maximums
      correspond to:
        1. The target is not performing an erase or program operation.
        2. The target is performing a program operation.
        3. The target is performing an erase operation.
    */
    status = semc_nand_wait_status_ready(handle, NAND_MAX_RST_TIME3_tRST_US, false);

    return status;
}

static status_t semc_nand_set_device_ecc(nand_handle_t *handle)
{
    status_t status;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    if (semcHandle->eccCheckType == kNandEccCheckType_DeviceECC)
    {
        if (handle->vendorType == kNandVendorType_Micron)
        {
            if (semcHandle->isFeatureCommandSupport)
            {
                nand_onfi_feature_config_t featureConfig = {
                    .command      = kNandDeviceCmd_ONFI_SetFeatures,
                    .address      = NAND_FLASH_DEVICEFEATURE_MT29F_ARRAYOPTIONMODEADDRESS,
                    .parameter[0] = NAND_FLASH_DEVICEFEATURE_MT29F_ARRAYOPTIONMODE_ENABLEECC,
                    .parameter[1] = 0,
                    .parameter[2] = 0,
                    .parameter[3] = 0};
                status = semc_nand_issue_access_feature(handle, &featureConfig);
                if (status != kStatus_Success)
                {
                    return status;
                }
            }
        }
    }
    else
    {
        if (handle->vendorType == kNandVendorType_Micron)
        {
            if (semcHandle->isFeatureCommandSupport)
            {
                nand_onfi_feature_config_t featureConfig = {
                    .command      = kNandDeviceCmd_ONFI_SetFeatures,
                    .address      = NAND_FLASH_DEVICEFEATURE_MT29F_ARRAYOPTIONMODEADDRESS,
                    .parameter[0] = NAND_FLASH_DEVICEFEATURE_MT29F_ARRAYOPTIONMODE_DISABLEECC,
                    .parameter[1] = 0,
                    .parameter[2] = 0,
                    .parameter[3] = 0};
                status = semc_nand_issue_access_feature(handle, &featureConfig);
                if (status != kStatus_Success)
                {
                    return status;
                }
            }
        }
    }

    return kStatus_Success;
}

static status_t semc_nand_issue_read_mode(nand_handle_t *handle)
{
    status_t status                    = kStatus_Success;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    /* READ MODE command is accepted by device when it is ready (RDY = 1, ARDY = 1). */
    status = semc_nand_wait_status_ready(handle, NAND_READY_CHECK_INTERVAL_NORMAL, false);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* The READ MODE command disables status output and enables data output */
    uint16_t commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_ReadMode,
                                                   kSEMC_NANDAM_ColumnRow, // Don't care
                                                   kSEMC_NANDCM_Command);  // Command Only
    status = SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, semcHandle->ctlAccessMemAddr1,
                                commandCode, 0, NULL);

