OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nand/semc/fsl_semc_nand_flash.c
        /* Note: For those command without address, the address should be valid as well,
          it shouldn't be out of IPG memory space, or SEMC IP will ignore this command.
        */
        slaveAddress = semcHandle->ctlAccessMemAddr1;
    }
    status = SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, slaveAddress, commandCode, 0,
                                &readoutData);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Set SR value according to readout data from Device */
    *stat = (uint8_t)readoutData;

    return kStatus_Success;
}

static status_t semc_nand_issue_read_page(nand_handle_t *handle, uint32_t ipgCmdAddr)
{
    status_t status                    = kStatus_Success;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    /* READ PAGE command is accepted by the device when it is ready (RDY = 1, ARDY = 1). */
    status = semc_nand_wait_status_ready(handle, NAND_READY_CHECK_INTERVAL_NORMAL, false);
    if (status != kStatus_Success)
    {
        return status;
    }

    uint16_t commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_ReadPageSetup,
                                                   kSEMC_NANDAM_ColumnRow,       // Address value
                                                   kSEMC_NANDCM_CommandAddress); // Command Address
    status = SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, ipgCmdAddr, commandCode, 0, 0);
    if (status != kStatus_Success)
    {
        return status;
    }

    commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_ReadPageConfirm,
                                          kSEMC_NANDAM_ColumnRow,    // Don't care
                                          kSEMC_NANDCM_CommandHold); // Commmand Hold
    status = SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, ipgCmdAddr, commandCode, 0, 0);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Monitors the target's R/B# signal or Reads the status register
      to determine the progress of the page data transfer. */
    status = semc_nand_wait_status_ready(handle, semcHandle->pageReadTimeInUs_tR, true);
    if (status != kStatus_Success)
    {
        return status;
    }

    return status;
}

static status_t semc_nand_is_device_ecc_check_passed(nand_handle_t *handle, bool *isEccPassed)
{
    status_t status = kStatus_Success;
    uint8_t SR      = 0;

    /* During READ operations the device executes the internal ECC engine (n-bit detection
        and (n-1)-bit error correction). When the READ operaton is complete, read status bit 0 must
        be checked to determine whether errors larger than n bits have occurred. */

    /* Note1: For MT29 series device: We just need to check SR[PASS] to see the ECC result for
        all types of operation(PROGRAM/ERASE/READ)
       Note2: For S34 series device: Error Detection Code check is a feature that can be used during the
      copy back program operation. For common program/erase, the Status Bit SR[PASS] may be checked. The
      internal write/erase verify detects only errors for 1’s/0's that are not successfully programmed to 0’s/1's.
      */
    status = semc_nand_issue_read_status(handle, &SR);
    if (status == kStatus_Success)
    {
        /* SR[PASS] = 0, Successful PROGRAM/ERASE/READ; SR[PASS] = 1, Error in PROGRAM/ERASE/READ */
        *isEccPassed = !(SR & NAND_FLASH_SR_ONFI_PASSBITMASK);
    }
    else
    {
        *isEccPassed = false;
    }

    /* READ MODE command should be issued in case read cycle is folowing. */
    status = semc_nand_issue_read_mode(handle);
    if (status != kStatus_Success)
    {
        return status;
    }

    return kStatus_Success;
}

status_t Nand_Flash_Read_Page_Partial(
    nand_handle_t *handle, uint32_t pageIndex, uint32_t offset_bytes, uint8_t *buffer, uint32_t length)
{
    status_t status     = kStatus_Success;
    uint32_t pageSize   = handle->bytesInPageDataArea + handle->bytesInPageSpareArea;
    uint32_t ipgCmdAddr = pageIndex * (1U << ((semc_mem_nand_handle_t *)handle->deviceSpecific)->columnWidth);
    uint32_t pageNum    = handle->pagesInBlock * handle->blocksInPlane * handle->planesInDevice;
    bool eccCheckPassed;

    /* Validate given length */
    if (((offset_bytes + length) > pageSize) || (pageIndex >= pageNum))
    {
        return kStatus_Fail;
    }

    /* Issues the page read command to device */
    status = semc_nand_issue_read_page(handle, ipgCmdAddr);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (((semc_mem_nand_handle_t *)handle->deviceSpecific)->eccCheckType == kNandEccCheckType_DeviceECC)
    {
        /* Check NAND Device ECC status if applicable */
        status = semc_nand_is_device_ecc_check_passed(handle, &eccCheckPassed);
        if ((status != kStatus_Success) || (!eccCheckPassed))
        {
            return kStatus_Fail;
        }
    }

    /* Read data from device through AXI */
    memcpy(buffer, (uint8_t *)(((semc_mem_nand_handle_t *)handle->deviceSpecific)->ctlAccessMemAddr2 + offset_bytes),
           length);
    while (!SEMC_IsInIdle((SEMC_Type *)handle->driverBaseAddr))
    {
    }

    return status;
}

/* Initialize Parallel NAND Flash device */
status_t Nand_Flash_Init(nand_config_t *config, nand_handle_t *handle)
{
    assert(config);
    assert(handle);

    semc_nand_timing_config_t semcNandTimingConfig;
    semc_mem_nand_config_t *semcConfig = (semc_mem_nand_config_t *)config->memControlConfig;
    semc_mem_nand_handle_t *semcHandle;
    bool setFlag = false;
    status_t status;

    memset(handle, 0, sizeof(handle));

    /* Store all needs for NAND operations. */
    handle->deviceSpecific = (void *)&semc_handle, handle->driverBaseAddr = config->driverBaseAddr;
    semcHandle                    = (semc_mem_nand_handle_t *)handle->deviceSpecific;
    semcHandle->delayUS           = semcConfig->delayUS;
    semcHandle->eccCheckType      = semcConfig->eccCheckType;
    semcHandle->readyCheckOption  = semcConfig->readyCheckOption;
    semcHandle->ctlAccessMemAddr1 = semcConfig->semcNandConfig->ipgAddress;
    semcHandle->ctlAccessMemAddr2 = semcConfig->semcNandConfig->axiAddress;
    semcHandle->columnWidth       = (NAND_FLASH_COLUMNBITSNUM_MAX - semcConfig->semcNandConfig->columnAddrBitNum);
    /* Currently we only support ONFI device. */
    if (semcConfig->onfiVersion == kNandOnfiVersion_None)
    {
        return kStatus_Fail;
    }

    if (!semcConfig->semcNandConfig->timingConfig)
    {
        /* Prepare the NAND configuration part one: get timing parameter in SEMC NAND configure structure. */
        semc_get_default_timing_configure(&semcNandTimingConfig);
        semcConfig->semcNandConfig->timingConfig = &semcNandTimingConfig;
        setFlag                                  = true;
    }

    /* Configure NAND flash. */
    status = SEMC_ConfigureNAND((SEMC_Type *)config->driverBaseAddr, semcConfig->semcNandConfig, semcConfig->clkSrc_Hz);
    if (status != kStatus_Success)
    {
        if (setFlag)
        {
            /* Clear the given timing configure variable. */
            semcConfig->semcNandConfig->timingConfig = NULL;
        }
        return status;
    }

    /* Issues the RESET command to device, make sure that we have clean NAND device status */
    status = semc_nand_issue_reset(handle);
    if (status != kStatus_Success)
    {
        if (setFlag)
        {
            /* Clear the given timing configure variable. */
            semcConfig->semcNandConfig->timingConfig = NULL;
        }
        return status;
    }

    /* Try to read ONFI parameter and reset the configure parameters. */
    status = semc_nand_get_onfi_timing_configure(handle, config);
    if (status != kStatus_Success)
    {
        if (setFlag)
        {
            /* Clear the given timing configure variable. */
            semcConfig->semcNandConfig->timingConfig = NULL;
        }
        return status;
    }

    /* Re-Init SEMC NAND module using new parameter */
    status = SEMC_ConfigureNAND((SEMC_Type *)config->driverBaseAddr, semcConfig->semcNandConfig, semcConfig->clkSrc_Hz);
    if (status != kStatus_Success)
    {
        if (setFlag)
        {
            /* Clear the given timing configure variable. */
            semcConfig->semcNandConfig->timingConfig = NULL;
        }
        return status;
    }

    /* Enable/Disable device ECC if necessary */
    status = semc_nand_set_device_ecc(handle);
    if (status != kStatus_Success)
    {
        if (setFlag)
        {
            /* Clear the given timing configure variable. */
            semcConfig->semcNandConfig->timingConfig = NULL;
        }
        return status;
    }
    /* Clear the given timing configure variable. */
    if (setFlag)
    {
        semcConfig->semcNandConfig->timingConfig = NULL;
    }
    return status;
}

