OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1052/components/flash/nand/semc/fsl_semc_nand_flash.c
status_t Nand_Flash_Read_Page(nand_handle_t *handle, uint32_t pageIndex, uint8_t *buffer, uint32_t length)
{
    status_t status = kStatus_Success;
    uint32_t ipgCmdAddr;
    bool eccCheckPassed                = false;
    uint32_t pageSize                  = handle->bytesInPageDataArea + handle->bytesInPageSpareArea;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;
    uint32_t pageNum                   = handle->pagesInBlock * handle->blocksInPlane * handle->planesInDevice;

    ipgCmdAddr = pageIndex * (1U << semcHandle->columnWidth);
    /* Validate given length */
    if ((length > pageSize) || (pageIndex >= pageNum))
    {
        return kStatus_Fail;
    }
    semcHandle->rowAddressToGetSR = ipgCmdAddr;

    /* Issues the page read command to device */
    status = semc_nand_issue_read_page(handle, ipgCmdAddr);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (semcHandle->eccCheckType == kNandEccCheckType_DeviceECC)
    {
        /* Check NAND Device ECC status if applicable */
        status = semc_nand_is_device_ecc_check_passed(handle, &eccCheckPassed);
        if ((status != kStatus_Success) || (!eccCheckPassed))
        {
            return kStatus_Fail;
        }
    }

    /* Read Page data from device through AXI */
    memcpy(buffer, (uint8_t *)semcHandle->ctlAccessMemAddr2, length);
    while (!SEMC_IsInIdle((SEMC_Type *)handle->driverBaseAddr))
    {
    }

    return status;
}

status_t Nand_Flash_Page_Program(nand_handle_t *handle, uint32_t pageIndex, uint8_t *src, uint32_t length)
{
    status_t status  = kStatus_Success;
    uint32_t pageNum = handle->pagesInBlock * handle->blocksInPlane * handle->planesInDevice;
    uint32_t ipgCmdAddr;
    bool eccCheckPassed = false;
    uint16_t commandCode;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;

    if ((length > (handle->bytesInPageDataArea + handle->bytesInPageSpareArea)) || (pageIndex >= pageNum))
    {
        return kStatus_Fail;
    }

    ipgCmdAddr                    = pageIndex * (1U << semcHandle->columnWidth);
    semcHandle->rowAddressToGetSR = ipgCmdAddr;

    /* PROGRAM PAGE command is excuteable when semc in idle. */
    while (!SEMC_IsInIdle((SEMC_Type *)handle->driverBaseAddr))
    {
    }

    /* PROGRAM PAGE command is accepted by the device when it is ready (RDY = 1, ARDY = 1). */
    status = semc_nand_wait_status_ready(handle, NAND_READY_CHECK_INTERVAL_NORMAL, false);
    if (status != kStatus_Success)
    {
        return status;
    }
    commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_ProgramPageSetup,
                                          kSEMC_NANDAM_ColumnRow,       // Address value
                                          kSEMC_NANDCM_CommandAddress); // Command Address
    status =
        SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, ipgCmdAddr, commandCode, 0, NULL);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* Write Page data to device
       Note: the memory address(row, column address) is always assigned by ipg commmand,
       the given address for axi command is just byte offset of available page array. */
    memcpy((uint8_t *)semcHandle->ctlAccessMemAddr2, (uint8_t *)src, length);
    while (!SEMC_IsInIdle((SEMC_Type *)handle->driverBaseAddr))
    {
    }

    /* Issues the page program command to device */
    commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_ProgramPageConfirm,
                                          kSEMC_NANDAM_ColumnRow, // Don't care
                                          kSEMC_NANDCM_Command);  // Commmand Only
    status =
        SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, ipgCmdAddr, commandCode, 0, NULL);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* Monitors the target's R/B# signal or Reads the status register
      to determine the progress of the page data transfer. */
    status = semc_nand_wait_status_ready(handle, semcHandle->PageProgramTimeInUs_tPROG, true);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (semcHandle->eccCheckType == kNandEccCheckType_DeviceECC)
    {
        /* Check NAND Device ECC status if applicable */
        status = semc_nand_is_device_ecc_check_passed(handle, &eccCheckPassed);
        if ((status != kStatus_Success) || (!eccCheckPassed))
        {
            return kStatus_Fail;
        }
    }

    return status;
}

status_t Nand_Flash_Erase_Block(nand_handle_t *handle, uint32_t blockIndex)
{
    status_t status = kStatus_Success;
    uint32_t ipgCmdAddr;
    bool eccCheckPassed                = false;
    semc_mem_nand_handle_t *semcHandle = (semc_mem_nand_handle_t *)handle->deviceSpecific;
    ipgCmdAddr                         = blockIndex * handle->pagesInBlock * (1 << semcHandle->columnWidth);

    if (blockIndex >= handle->blocksInPlane * handle->planesInDevice)
    {
        return kStatus_Fail;
    }

    semcHandle->rowAddressToGetSR = ipgCmdAddr;

    /* Issues the block erase command to device
      ERASE BLOCK command is accepted by the device when it is ready (RDY = 1, ARDY = 1).*/
    status = semc_nand_wait_status_ready(handle, NAND_READY_CHECK_INTERVAL_NORMAL, false);
    if (status != kStatus_Success)
    {
        return status;
    }
    /* SA = blockIndex * pagesInBlock * pageDataSize */
    uint16_t commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_EraseBlockSetup,
                                                   kSEMC_NANDAM_RawRA0RA1RA2,    // Address value
                                                   kSEMC_NANDCM_CommandAddress); // Command Address
    status =
        SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, ipgCmdAddr, commandCode, 0, NULL);
    if (status != kStatus_Success)
    {
        return status;
    }

    commandCode = SEMC_BuildNandIPCommand(kNandDeviceCmd_ONFI_EraseBlockConfirm,
                                          kSEMC_NANDAM_RawRA0RA1RA2, // Don't care
                                          kSEMC_NANDCM_CommandHold); // Commmand Hold
    status =
        SEMC_SendIPCommand((SEMC_Type *)handle->driverBaseAddr, kSEMC_MemType_NAND, ipgCmdAddr, commandCode, 0, NULL);
    if (status != kStatus_Success)
    {
        return status;
    }

    status = semc_nand_wait_status_ready(handle, semcHandle->blockEraseTimeInUs_tBERS, false);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (semcHandle->eccCheckType == kNandEccCheckType_DeviceECC)
    {
        /* Check NAND Device ECC status if applicable */
        status = semc_nand_is_device_ecc_check_passed(handle, &eccCheckPassed);
        if ((status != kStatus_Success) || (!eccCheckPassed))
        {
            return kStatus_Fail;
        }
    }

    return kStatus_Success;
}
